#ΕΛΛΗΝΙΚΗ ΑΡΙΘΜΟΜΗΧΑΝΗ 🇬🇷🇬🇷
import math
συν = "Ν" or "N"
while συν == "Ν" or "N" :
 
 print("Δώσε επιλογή:\n1.Πρόσθεση\n2.Αφαίρεση\n3.Πολλαπλασιασμός\n4.Διαίρεση\n5.Δύναμη\n6.Τετραγωνική ρίζα")
 επιλ=input("Επέλεξε πράξη!: ")      
 num1 = float(input("Δώσε πρώτο αριθμό: "))
 if επιλ== "6":
    num2=0
 else:
  num2 = float(input("Δώσε δεύτερο αριθμό: "))
 #ΠΡΑΞΗ ΠΡΟΣΘΕΣΗΣ
 if  επιλ == '1':
          print(num1,"+",num2,"=", (num1 + num2))
 #ΠΡΑΞΗ ΑΦΑΙΡΕΣΗΣ
 elif επιλ == '2':
          print(num1,"-",num2,"=", (num1 - num2))
 #ΠΡΑΞΗ ΠΟΛΛΑΠΛΑΣΙΣΜΟΥ
 elif επιλ == '3':
          print(num1,"*",num2,"=", (num1 * num2))
 #ΠΡΑΞΗ ΔΙΑΙΡΕΣΗΣ
 elif επιλ == '4':
          print(num1,"/",num2,"=", (num1 / num2))
 #ΠΡΑΞΗ ΔΥΝΑΜΗΣ
 elif επιλ == '5':
          print(num1,"^",num2,"=", (num1 ** num2))
 #ΠΡΑΞΗ  ΤΕΤΡΑΓΩΝΙΚΗΣ ΡΙΖΑΣ
 elif επιλ =="6":
    print(math.sqrt(num1))
 else:
          print("Αδύνατη πράξη ):")
 cont  = input("θες να συνεχίσεις enter/Ο: ")
      
 if cont == "O":
          print("Σε ευχαριστώ που με χρησιμοποίησες (:")
          break
 elif cont == "Ο":
          print("Σε ευχαριστώ που με χρησιμοποίησες (:")
          break
 elif cont == "ο":
          print("Σε ευχαριστώ που με χρησιμοποίησες (:")
          break
 elif cont == "o":
          print("Σε ευχαριστώ που με χρησιμοποίησες (:")
          break
       
       
       
       
     
    
    
    
